from tkinter import *

gui = Tk()
gui.geometry("600x600")
##############################################################
def onselect(evt):
    w = evt.widget
    index = int(w.curselection()[0])
    global value
    value = w.get(index)
    print('You selected item %d: "%s"' % (index, value))
# ##############################################################
listbox = Listbox(gui, selectmode='extended', height=40)
listbox.grid(row = 0, column = 1)
listbox.bind('<<ListboxSelect>>', onselect)
##############################################################
# a = listbox.get(first)
# print(a)
# ##############################################################
# v = StringVar()
# e = Entry(gui, textvariable=v)
# e.grid(row = 0, column = 40)
# v.set("")
##############################################################
Stations = ['서울역(1)', '시청(1)', '종각(1)', '종로3가(1)', '종로5가(1)', '동대문(1)',
            '동묘앞(1)', '신설동(1)', '제기동(1)', '시청(2)', '을지로입구(2)', '을지로3가(2)',
            '을지로4가(2)', '동대문운동장(2)', '신당(2)', '상왕십리(2)', '왕십리(2)', '한양대(2)',
            '뚝섬(2)', '성수(2)', '건대입구(2)', '구의(2)', '강변(2)', '성내(2)', '잠실(2)',
            '신천(2)', '종합운동장(2)', '삼성(2)', '선릉(2)', '역삼(2)', '강남(2)', '교대(2)',
            '서초(2)', '방배(2)', '사당(2)', '낙성대(2)', '서울대입구(2)', '봉천(2)', '신림(2)',
            '신대방(2)', '구로디지털단지(2)', '대림(2)', '신도림(2)', '문래(2)', '영등포구청(2)',
            '당산(2)', '합정(2)', '홍대입구(2)', '신촌(2)', '이대(2)', '아현(2)', '충정로(2)',
            '지축(3)', '구파발(3)', '연신내(3)', '불광(3)', '녹번(3)', '홍제(3)', '무악재(3)',
            '독립문(3)', '경복궁(3)', '안국(3)', '종로3가(3)', '을지로3가(3)', '충무로(3)',
            '동대입구(3)', '약수(3)', '금호(3)', '옥수(3)', '압구정(3)', '신사(3)', '잠원(3)',
            '고속터미널(3)', '교대(3)', '남부터미널(3)', '양재(3)', '매봉(3)', '도곡(3)',
            '대치(3)', '학여울(3)', '대청(3)', '일원(3)', '당고개(4)', '상계(4)', '노원(4)',
            '창동(4)', '쌍문(4)', '수유(4)', '미아(4)', '미아삼거리(4)', '길음(4)', '성신여대입구(4)',
            '한성대입구(4)', '혜화(4)', '동대문(4)', '동대문운동장(4)', '충무로(4)', '명동(4)',
            '회현(4)', '서울역(4)', '숙대입구(4)', '삼각지(4)', '신용산(4)', '이촌(4)', '동작(4)',
            '총신대입구(4)', '사당(4)']

for i in range(len(Stations)):
    listbox.insert(i, Stations[i])
##############################################################
def subway(graph, start, end):
    visit = []
    visit.append(start)
    curStation = start
    time = 0
    while True:
        nextStation = g[curStation][0]
        time += g[curStation][1]
        curStation = nextStation
        visit.append(nextStation)
        if nextStation == end:
            return visit, time
            break
##############################################################


button_1 = Button(gui, text = "start", command = onselect(evt)).grid(row = 0, column = 38)
button_2 = Button(gui, text = "end",command = onselect(evt)).grid(row = 0, column = 41)




gui.mainloop()

